index.org
#+title: Machimania
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="styles.css">
#+OPTIONS: num:4 toc:4

* Broader game-design
Explores the broader game design and values the creators would like to explore.
** Game summary
Machimania is an adventure game that explores a post-apocalyptic futuristic world, with a creative turn-based strategy battle system.
*** Core mechanic
Battle system
** TODO Narrative
How complex do we want the narrative to be?
** TODO Development priorities
What are the project milestones and their progression?
*** Ideation
How do we ideate? Chat, deliberate agendas, mood boards, inspirations from other games...? How do you visualize plot?
**** Concept testing
**** Feedback loop
*** Prototyping Goals
What should the prototype look like?
*** Ideal outcome
What is the vision of the final game? What's the "marketing story"?
** TODO Development
*** Communication
How are discussions held? How are discussions structured?
*** Notes
How is information about the game design / development structure stored?
*** Tools and platforms
What do we use for developing the game?
** TODO Design principles

What are the principles that guide the design?
*** Agency
How much control does the player have over the game? What actions cause deliberate changes? What actions cost anything?
*** Pacing
What's the expected game time? How fast does the narrative unfold? How
*** Quality of life, game feedback, rewards
Includes prompts, hints, notes, cues, that are provided to the player in order for them to have a better gameplay experience with QOL.


*** Core mission
How does the player "win"? What is the player's goal?
*** Strategy and challenge
What broader strategies do we want the player to execute or learn as they progress through the game?
What challenges exist? What solutions exist to complete the "core mission"?
*** Gameplay balance
Related to "Strategy and challenge". How difficult do we want the game to be?

*** Mood and atmosphere
What "vibe" do we want with the game? Is it supposed to be immersive? What's the atmosphere - dark? Or is it more detached, like management games?
How do we give  information do we give (see: Pacing) - is it like Minecraft's mystery that arises from no dialogue with NPCs?
Are the themes in-your-face, or are they subtle?

*** Narrative structures or goals
Are there some particular narrative sturcture we want to explore - e.g. monomyth, three-act/Aristotelian structure.
Do we use in medias res? W
What plot devices do we want to use - e.g. deus ex machina, plot vouchers (objects given to a player that then play a specific role later), red herrings, flashbacks, unreliable narrator, non-linear narratives, ...
character flaws, irony, motif, stock characters, character arcs, deuteragonists, narration, verisimilitude (belivability/degree suspension of disbelief), genre...
What tropes do we want to use or subvert?

How is the writing done (i.e. what does the player read)? Do we use description, exposition, narration, ...
