index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-26 Sun 14:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machimania</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Machimania</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org20e2ad1">1. Broader game-design</a>
<ul>
<li><a href="#org5bdba84">1.1. Game summary</a>
<ul>
<li><a href="#org69a3710">1.1.1. Core mechanic</a></li>
</ul>
</li>
<li><a href="#org6c540e6">1.2. <span class="todo TODO">TODO</span> Narrative</a></li>
<li><a href="#org04aad3e">1.3. <span class="todo TODO">TODO</span> Development priorities</a>
<ul>
<li><a href="#org13cf3a8">1.3.1. Ideation</a></li>
<li><a href="#org23f6c53">1.3.2. Prototyping Goals</a></li>
<li><a href="#org18a5672">1.3.3. Ideal outcome</a></li>
</ul>
</li>
<li><a href="#org9e1ed64">1.4. <span class="todo TODO">TODO</span> Development</a>
<ul>
<li><a href="#org3f6eb40">1.4.1. Communication</a></li>
<li><a href="#org435de12">1.4.2. Notes</a></li>
<li><a href="#org0e2ff47">1.4.3. Tools and platforms</a></li>
</ul>
</li>
<li><a href="#org3bede3c">1.5. <span class="todo TODO">TODO</span> Design principles</a>
<ul>
<li><a href="#org664d72a">1.5.1. Agency</a></li>
<li><a href="#orge89728e">1.5.2. Pacing</a></li>
<li><a href="#orgd0e8d6c">1.5.3. Quality of life, game feedback, rewards</a></li>
<li><a href="#orgf5c0370">1.5.4. Core mission</a></li>
<li><a href="#orga430c9d">1.5.5. Strategy and challenge</a></li>
<li><a href="#org2fcac40">1.5.6. Gameplay balance</a></li>
<li><a href="#orge060165">1.5.7. Mood and atmosphere</a></li>
<li><a href="#orgb71161b">1.5.8. Narrative structures or goals</a></li>
</ul>
</li>
<li><a href="#org1639cdb">1.6. <span class="todo TODO">TODO</span> Audience</a></li>
<li><a href="#orga24e140">1.7. <span class="todo TODO">TODO</span> Influences</a></li>
<li><a href="#org5cc7d7b">1.8. Things we don&rsquo;t want</a>
<ul>
<li><a href="#org5b41659">1.8.1. Feature creep</a></li>
<li><a href="#orge5adc4f">1.8.2. Scope creep</a></li>
<li><a href="#org3f925bf">1.8.3. Too much focus on details</a></li>
<li><a href="#orgbc7d9f1">1.8.4. Too much focus on big idea</a></li>
<li><a href="#org5673ccd">1.8.5. Lack of agreement</a></li>
<li><a href="#org221f7d0">1.8.6. Unclear commitments, priorities and expectation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7338ace">2. Narrative</a>
<ul>
<li><a href="#org35f7fe7">2.1. <span class="todo TODO">TODO</span> Narrative</a>
<ul>
<li><a href="#org3179d10">2.1.1. <span class="todo TODO">TODO</span> Themes</a></li>
<li><a href="#org19509f9">2.1.2. <span class="todo TODO">TODO</span> Setting</a></li>
<li><a href="#orgc375e05">2.1.3. <span class="todo TODO">TODO</span> History</a></li>
<li><a href="#org5e3c6f4">2.1.4. <span class="todo TODO">TODO</span> Society (of main setting)</a></li>
<li><a href="#org7a22a34">2.1.5. <span class="todo TODO">TODO</span> Main Character</a></li>
<li><a href="#orge67ba83">2.1.6. <span class="todo TODO">TODO</span> Main Plot</a></li>
<li><a href="#org737760f">2.1.7. <span class="todo TODO">TODO</span> Subplots</a></li>
<li><a href="#org3fab615">2.1.8. <span class="todo TODO">TODO</span> Other Characters</a></li>
<li><a href="#org6177be2">2.1.9. <span class="todo TODO">TODO</span> Places</a></li>
<li><a href="#orge1a3733">2.1.10. <span class="todo TODO">TODO</span> Relationships</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ba1fb8">3. Realization of Narrative</a>
<ul>
<li>
<ul>
<li><a href="#orga0a74db">3.0.1. <span class="todo TODO">TODO</span> Plot Progression</a></li>
<li><a href="#org4502809">3.0.2. <span class="todo TODO">TODO</span> Locations</a></li>
<li><a href="#orga2d81e1">3.0.3. <span class="todo TODO">TODO</span> Map Design</a></li>
<li><a href="#orgd1f85c6">3.0.4. <span class="todo TODO">TODO</span> Gameplay</a></li>
<li><a href="#org9493706">3.0.5. <span class="todo TODO">TODO</span> Art and Music</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org665d7a7">4. Gameplay</a>
<ul>
<li><a href="#orga573106">4.1. <span class="todo TODO">TODO</span> Features</a>
<ul>
<li><a href="#org0366640">4.1.1. <span class="todo TODO">TODO</span> Gameplay loops</a></li>
<li><a href="#orgd7c9946">4.1.2. <span class="todo TODO">TODO</span> User interface and controls</a></li>
<li><a href="#org8bbc30b">4.1.3. <span class="todo TODO">TODO</span> Global systems</a></li>
<li><a href="#orgd9505d8">4.1.4. <span class="todo TODO">TODO</span> In-map interactions</a></li>
<li><a href="#org07eeda6">4.1.5. <span class="todo TODO">TODO</span> Battle system</a></li>
</ul>
</li>
<li><a href="#org70899bf">4.2. <span class="todo TODO">TODO</span> Strategy and Progression</a></li>
</ul>
</li>
<li><a href="#org5a60261">5. Current work</a>
<ul>
<li><a href="#orgecb836e">5.1. <span class="todo TODO">TODO</span> Prototype</a></li>
<li><a href="#org1a76ce7">5.2. <span class="todo TODO">TODO</span> Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org20e2ad1" class="outline-2">
<h2 id="org20e2ad1"><span class="section-number-2">1.</span> Broader game-design</h2>
<div class="outline-text-2" id="text-1">
<p>
Explores the broader game design and values the creators would like to explore.
</p>
</div>
<div id="outline-container-org5bdba84" class="outline-3">
<h3 id="org5bdba84"><span class="section-number-3">1.1.</span> Game summary</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Machimania is an adventure game that explores a post-apocalyptic futuristic world, with a creative turn-based strategy battle system.
</p>
</div>
<div id="outline-container-org69a3710" class="outline-4">
<h4 id="org69a3710"><span class="section-number-4">1.1.1.</span> Core mechanic</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Battle system
</p>
</div>
</div>
</div>
<div id="outline-container-org6c540e6" class="outline-3">
<h3 id="org6c540e6"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> Narrative</h3>
<div class="outline-text-3" id="text-1-2">
<p>
How complex do we want the narrative to be?
</p>
</div>
</div>
<div id="outline-container-org04aad3e" class="outline-3">
<h3 id="org04aad3e"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> Development priorities</h3>
<div class="outline-text-3" id="text-1-3">
<p>
What are the project milestones and their progression?
</p>
</div>
<div id="outline-container-org13cf3a8" class="outline-4">
<h4 id="org13cf3a8"><span class="section-number-4">1.3.1.</span> Ideation</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
How do we ideate? Chat, deliberate agendas, mood boards, inspirations from other games&#x2026;? How do you visualize plot?
</p>
</div>
<ol class="org-ol">
<li><a id="orgc8faa8e"></a>Concept testing<br /></li>
<li><a id="org4800d28"></a>Feedback loop<br /></li>
</ol>
</div>
<div id="outline-container-org23f6c53" class="outline-4">
<h4 id="org23f6c53"><span class="section-number-4">1.3.2.</span> Prototyping Goals</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
What should the prototype look like?
</p>
</div>
</div>
<div id="outline-container-org18a5672" class="outline-4">
<h4 id="org18a5672"><span class="section-number-4">1.3.3.</span> Ideal outcome</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
What is the vision of the final game? What&rsquo;s the &ldquo;marketing story&rdquo;?
</p>
</div>
</div>
</div>
<div id="outline-container-org9e1ed64" class="outline-3">
<h3 id="org9e1ed64"><span class="section-number-3">1.4.</span> <span class="todo TODO">TODO</span> Development</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org3f6eb40" class="outline-4">
<h4 id="org3f6eb40"><span class="section-number-4">1.4.1.</span> Communication</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
How are discussions held? How are discussions structured?
</p>
</div>
</div>
<div id="outline-container-org435de12" class="outline-4">
<h4 id="org435de12"><span class="section-number-4">1.4.2.</span> Notes</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
How is information about the game design / development structure stored?
</p>
</div>
</div>
<div id="outline-container-org0e2ff47" class="outline-4">
<h4 id="org0e2ff47"><span class="section-number-4">1.4.3.</span> Tools and platforms</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
What do we use for developing the game?
</p>
</div>
</div>
</div>
<div id="outline-container-org3bede3c" class="outline-3">
<h3 id="org3bede3c"><span class="section-number-3">1.5.</span> <span class="todo TODO">TODO</span> Design principles</h3>
<div class="outline-text-3" id="text-1-5">
<p>
What are the principles that guide the design?
</p>
</div>
<div id="outline-container-org664d72a" class="outline-4">
<h4 id="org664d72a"><span class="section-number-4">1.5.1.</span> Agency</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
How much control does the player have over the game? What actions cause deliberate changes? What actions cost anything?
</p>
</div>
</div>
<div id="outline-container-orge89728e" class="outline-4">
<h4 id="orge89728e"><span class="section-number-4">1.5.2.</span> Pacing</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
What&rsquo;s the expected game time? How fast does the narrative unfold? How
</p>
</div>
</div>
<div id="outline-container-orgd0e8d6c" class="outline-4">
<h4 id="orgd0e8d6c"><span class="section-number-4">1.5.3.</span> Quality of life, game feedback, rewards</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Includes prompts, hints, notes, cues, that are provided to the player in order for them to have a better gameplay experience with QOL.
</p>
</div>
</div>
<div id="outline-container-orgf5c0370" class="outline-4">
<h4 id="orgf5c0370"><span class="section-number-4">1.5.4.</span> Core mission</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
How does the player &ldquo;win&rdquo;? What is the player&rsquo;s goal?
</p>
</div>
</div>
<div id="outline-container-orga430c9d" class="outline-4">
<h4 id="orga430c9d"><span class="section-number-4">1.5.5.</span> Strategy and challenge</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
What broader strategies do we want the player to execute or learn as they progress through the game?
What challenges exist? What solutions exist to complete the &ldquo;core mission&rdquo;?
</p>
</div>
</div>
<div id="outline-container-org2fcac40" class="outline-4">
<h4 id="org2fcac40"><span class="section-number-4">1.5.6.</span> Gameplay balance</h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
Related to &ldquo;Strategy and challenge&rdquo;. How difficult do we want the game to be?
</p>
</div>
</div>
<div id="outline-container-orge060165" class="outline-4">
<h4 id="orge060165"><span class="section-number-4">1.5.7.</span> Mood and atmosphere</h4>
<div class="outline-text-4" id="text-1-5-7">
<p>
What &ldquo;vibe&rdquo; do we want with the game? Is it supposed to be immersive? What&rsquo;s the atmosphere - dark? Or is it more detached, like management games?
How do we give  information do we give (see: Pacing) - is it like Minecraft&rsquo;s mystery that arises from no dialogue with NPCs?
Are the themes in-your-face, or are they subtle?
</p>
</div>
</div>
<div id="outline-container-orgb71161b" class="outline-4">
<h4 id="orgb71161b"><span class="section-number-4">1.5.8.</span> Narrative structures or goals</h4>
<div class="outline-text-4" id="text-1-5-8">
<p>
Are there some particular narrative sturcture we want to explore - e.g. monomyth, three-act/Aristotelian structure.
Do we use in medias res? W
What plot devices do we want to use - e.g. deus ex machina, plot vouchers (objects given to a player that then play a specific role later), red herrings, flashbacks, unreliable narrator, non-linear narratives, &#x2026;
character flaws, irony, motif, stock characters, character arcs, deuteragonists, narration, verisimilitude (belivability/degree suspension of disbelief), genre&#x2026;
What tropes do we want to use or subvert?
</p>

<p>
How is the writing done (i.e. what does the player read)? Do we use description, exposition, narration, &#x2026;
</p>
</div>
</div>
</div>
