index.org
** TODO Audience
Who's going to play the game? What audience do you imagine is playing this game? What choices do we need to do to accommodate the audience?
** TODO Influences
What are some similar games? What do some games do well, and that we want to incorporate? How about bad games?
What features from other games "would be fun to create myself"?

** Things we don't want
*** Feature creep
We don't want to be too ambitious. We can explore a lot of features, or world-building, but not all will be part of the final game.
Heuristics like "keep it simple" can help with the pruning.

https://en.wikipedia.org/wiki/Feature_creep
*** Scope creep
https://en.wikipedia.org/wiki/Scope_creep
*** Too much focus on details
*** Too much focus on big idea
A lot of planning without concrete work doesn't lead to anything substantial (unless the expectation is just a fun exploration of game design and ideation).
*** Lack of agreement
Differences in vision, lack of consensus regarding features, lack of communication, lack of definitions or agreed definitions, lack of purpose in discussion.
*** Unclear commitments, priorities and expectation
Is this an actual project and what are the commitments and expectations?
* Narrative
** TODO Narrative
This section describes the world as from someone's perspective in-universe (as opposed to in-game).
In this section, we focus on world-building and forget (for now) the trappings of the game.
This allows us to separate world-building and world-realization.
*** TODO Themes

Refers to the overarching ideas to be explored in the game's narrative elements. If you had a "message", or "perspective" or "argument " as an author - what would that be?
Themes guide the writing and design and gameplay.
**** Core Themes
e.g.
- humans relationship with technology,
- governance
- diy/tech culture
-futuristic society, unsustainable growth, factions, making fun of current technology trends
**** Smaller themes
- llms
- product/software fails

*** TODO Setting
What time period or locations exist in the world? What are the assumptions (i.e. "magic exists") of this world, as in, what differences-from-IRL-world exist here?"

**** Time
Post apocalyptic world, year 23XX.

**** Main Location
Where does our main character live and primarily work in?

*** TODO History

Why is the world the way it is? If it's based in real life, what are the points of divergence? How did things go differently in history - i.e. perhaps New World cultures were not massively wiped out.
If it's not based in real life, what was the world generally like, and what are the events that lead to now?

The MC's history can be explored here too.

**** Pre-apocalypse
What was the world like before things "started becoming wrong"?
**** Just before the apocalypse
What were the leading events to the apocalypse?

**** The apocalypse
What happened during the apocalypse?


**** Just after the apocalypse
What are the apocalypse's immediate effects? What became the "new normal"?

**** Very recent history and present state
What are the present state of affairs? What are some recent events that are relevant to the present state of affairs?

**** Things to happen
Suppose you are at a particular month X, year Y. What (major) events are known to happen  the point of month X, year Y -- for example, the annual Machimania competition.

*** TODO Society (of main setting)

Informed by theme, works within setting, history.
How is the social landscape? What values are important? How does normal life go?
Why is it the way it is? Why are these systems in place? What subcultures are there?

**** Neo-SF Government

Faux-democratic actually-oligarchic techno-kleptocracy.

**** Machimania sport and League
**** Education
**** Economy
**** Culture and Values
**** Social strata or groups
**** Law and Order
**** Attitude towards other places
Explored more in "relationships". How does the society think of themselves and what do they think of other societies?
Is there some sort of sense of "superiority" or "things we do better" w.r.t to other cultures? What are commonalities?

**** Attitude towards problems
What solution would the current culture pursue to certain problems?

*** TODO Main Character
Who is our main character, what is their past, what is their personality, their goals, and relationships to other characters and the world?
What are some points of growth for our main character to be explored through the main plot (and themes?
**** Who
**** Past
**** Goals
*** TODO Main Plot
What is the main plot progression? If it's non-linear, what are points of divergence? Can it be graphed?
Remember, this is "in-universe" and not necessarily "in-game".
Consider a universe - let's call it America. An author writes about America.
How does the plot progress?

**** Intro
**** Rising action
**** Climax
**** Falling action
**** Ending(s)
