index.html
<div id="outline-container-org1639cdb" class="outline-3">
<h3 id="org1639cdb"><span class="section-number-3">1.6.</span> <span class="todo TODO">TODO</span> Audience</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Who&rsquo;s going to play the game? What audience do you imagine is playing this game? What choices do we need to do to accommodate the audience?
</p>
</div>
</div>
<div id="outline-container-orga24e140" class="outline-3">
<h3 id="orga24e140"><span class="section-number-3">1.7.</span> <span class="todo TODO">TODO</span> Influences</h3>
<div class="outline-text-3" id="text-1-7">
<p>
What are some similar games? What do some games do well, and that we want to incorporate? How about bad games?
What features from other games &ldquo;would be fun to create myself&rdquo;?
</p>
</div>
</div>
<div id="outline-container-org5cc7d7b" class="outline-3">
<h3 id="org5cc7d7b"><span class="section-number-3">1.8.</span> Things we don&rsquo;t want</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-org5b41659" class="outline-4">
<h4 id="org5b41659"><span class="section-number-4">1.8.1.</span> Feature creep</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
We don&rsquo;t want to be too ambitious. We can explore a lot of features, or world-building, but not all will be part of the final game.
Heuristics like &ldquo;keep it simple&rdquo; can help with the pruning.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Feature_creep">https://en.wikipedia.org/wiki/Feature_creep</a>
</p>
</div>
</div>
<div id="outline-container-orge5adc4f" class="outline-4">
<h4 id="orge5adc4f"><span class="section-number-4">1.8.2.</span> Scope creep</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
<a href="https://en.wikipedia.org/wiki/Scope_creep">https://en.wikipedia.org/wiki/Scope_creep</a>
</p>
</div>
</div>
<div id="outline-container-org3f925bf" class="outline-4">
<h4 id="org3f925bf"><span class="section-number-4">1.8.3.</span> Too much focus on details</h4>
</div>
<div id="outline-container-orgbc7d9f1" class="outline-4">
<h4 id="orgbc7d9f1"><span class="section-number-4">1.8.4.</span> Too much focus on big idea</h4>
<div class="outline-text-4" id="text-1-8-4">
<p>
A lot of planning without concrete work doesn&rsquo;t lead to anything substantial (unless the expectation is just a fun exploration of game design and ideation).
</p>
</div>
</div>
<div id="outline-container-org5673ccd" class="outline-4">
<h4 id="org5673ccd"><span class="section-number-4">1.8.5.</span> Lack of agreement</h4>
<div class="outline-text-4" id="text-1-8-5">
<p>
Differences in vision, lack of consensus regarding features, lack of communication, lack of definitions or agreed definitions, lack of purpose in discussion.
</p>
</div>
</div>
<div id="outline-container-org221f7d0" class="outline-4">
<h4 id="org221f7d0"><span class="section-number-4">1.8.6.</span> Unclear commitments, priorities and expectation</h4>
<div class="outline-text-4" id="text-1-8-6">
<p>
Is this an actual project and what are the commitments and expectations?
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org7338ace" class="outline-2">
<h2 id="org7338ace"><span class="section-number-2">2.</span> Narrative</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org35f7fe7" class="outline-3">
<h3 id="org35f7fe7"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> Narrative</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This section describes the world as from someone&rsquo;s perspective in-universe (as opposed to in-game).
In this section, we focus on world-building and forget (for now) the trappings of the game.
This allows us to separate world-building and world-realization.
</p>
</div>
<div id="outline-container-org3179d10" class="outline-4">
<h4 id="org3179d10"><span class="section-number-4">2.1.1.</span> <span class="todo TODO">TODO</span> Themes</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Refers to the overarching ideas to be explored in the game&rsquo;s narrative elements. If you had a &ldquo;message&rdquo;, or &ldquo;perspective&rdquo; or &ldquo;argument &rdquo; as an author - what would that be?
Themes guide the writing and design and gameplay.
</p>
</div>
<ol class="org-ol">
<li><a id="orgf623910"></a>Core Themes<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
e.g.
</p>
<ul class="org-ul">
<li>humans relationship with technology,</li>
<li>governance</li>
<li>diy/tech culture</li>
</ul>
<p>
-futuristic society, unsustainable growth, factions, making fun of current technology trends
</p>
</div>
</li>
<li><a id="orga0f6873"></a>Smaller themes<br />
<div class="outline-text-5" id="text-2-1-1-2">
<ul class="org-ul">
<li>llms</li>
<li>product/software fails</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org19509f9" class="outline-4">
<h4 id="org19509f9"><span class="section-number-4">2.1.2.</span> <span class="todo TODO">TODO</span> Setting</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
What time period or locations exist in the world? What are the assumptions (i.e. &ldquo;magic exists&rdquo;) of this world, as in, what differences-from-IRL-world exist here?"
</p>
</div>
<ol class="org-ol">
<li><a id="org61bfbb5"></a>Time<br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
Post apocalyptic world, year 23XX.
</p>
</div>
</li>
<li><a id="org85c7e8a"></a>Main Location<br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
Where does our main character live and primarily work in?
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc375e05" class="outline-4">
<h4 id="orgc375e05"><span class="section-number-4">2.1.3.</span> <span class="todo TODO">TODO</span> History</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Why is the world the way it is? If it&rsquo;s based in real life, what are the points of divergence? How did things go differently in history - i.e. perhaps New World cultures were not massively wiped out.
If it&rsquo;s not based in real life, what was the world generally like, and what are the events that lead to now?
</p>

<p>
The MC&rsquo;s history can be explored here too.
</p>
</div>
<ol class="org-ol">
<li><a id="org95f0235"></a>Pre-apocalypse<br />
<div class="outline-text-5" id="text-2-1-3-1">
<p>
What was the world like before things &ldquo;started becoming wrong&rdquo;?
</p>
</div>
</li>
<li><a id="orga45b47e"></a>Just before the apocalypse<br />
<div class="outline-text-5" id="text-2-1-3-2">
<p>
What were the leading events to the apocalypse?
</p>
</div>
</li>
<li><a id="orgfc47d9e"></a>The apocalypse<br />
<div class="outline-text-5" id="text-2-1-3-3">
<p>
What happened during the apocalypse?
</p>
</div>
</li>
<li><a id="org4a83089"></a>Just after the apocalypse<br />
<div class="outline-text-5" id="text-2-1-3-4">
<p>
What are the apocalypse&rsquo;s immediate effects? What became the &ldquo;new normal&rdquo;?
</p>
</div>
</li>
<li><a id="orgf066035"></a>Very recent history and present state<br />
<div class="outline-text-5" id="text-2-1-3-5">
<p>
What are the present state of affairs? What are some recent events that are relevant to the present state of affairs?
</p>
</div>
</li>
<li><a id="org40663d0"></a>Things to happen<br />
<div class="outline-text-5" id="text-2-1-3-6">
<p>
Suppose you are at a particular month X, year Y. What (major) events are known to happen  the point of month X, year Y &#x2013; for example, the annual Machimania competition.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5e3c6f4" class="outline-4">
<h4 id="org5e3c6f4"><span class="section-number-4">2.1.4.</span> <span class="todo TODO">TODO</span> Society (of main setting)</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Informed by theme, works within setting, history.
How is the social landscape? What values are important? How does normal life go?
Why is it the way it is? Why are these systems in place? What subcultures are there?
</p>
</div>
<ol class="org-ol">
<li><a id="org01476e8"></a>Neo-SF Government<br />
<div class="outline-text-5" id="text-2-1-4-1">
<p>
Faux-democratic actually-oligarchic techno-kleptocracy.
</p>
</div>
</li>
<li><a id="orge060b2b"></a>Machimania sport and League<br /></li>
<li><a id="org54c49d9"></a>Education<br /></li>
<li><a id="org66ad91c"></a>Economy<br /></li>
<li><a id="orgab5a2c3"></a>Culture and Values<br /></li>
<li><a id="org07063dd"></a>Social strata or groups<br /></li>
<li><a id="org4ff36a1"></a>Law and Order<br /></li>
<li><a id="org0c433bb"></a>Attitude towards other places<br />
<div class="outline-text-5" id="text-2-1-4-8">
<p>
Explored more in &ldquo;relationships&rdquo;. How does the society think of themselves and what do they think of other societies?
Is there some sort of sense of &ldquo;superiority&rdquo; or &ldquo;things we do better&rdquo; w.r.t to other cultures? What are commonalities?
</p>
</div>
</li>
<li><a id="orgf5bb3e3"></a>Attitude towards problems<br />
<div class="outline-text-5" id="text-2-1-4-9">
<p>
What solution would the current culture pursue to certain problems?
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7a22a34" class="outline-4">
<h4 id="org7a22a34"><span class="section-number-4">2.1.5.</span> <span class="todo TODO">TODO</span> Main Character</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
Who is our main character, what is their past, what is their personality, their goals, and relationships to other characters and the world?
What are some points of growth for our main character to be explored through the main plot (and themes?
</p>
</div>
<ol class="org-ol">
<li><a id="orgd9a4195"></a>Who<br /></li>
<li><a id="orga8b4c15"></a>Past<br /></li>
<li><a id="org1819886"></a>Goals<br /></li>
</ol>
</div>
<div id="outline-container-orge67ba83" class="outline-4">
<h4 id="orge67ba83"><span class="section-number-4">2.1.6.</span> <span class="todo TODO">TODO</span> Main Plot</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
What is the main plot progression? If it&rsquo;s non-linear, what are points of divergence? Can it be graphed?
Remember, this is &ldquo;in-universe&rdquo; and not necessarily &ldquo;in-game&rdquo;.
Consider a universe - let&rsquo;s call it America. An author writes about America.
How does the plot progress?
</p>
</div>
<ol class="org-ol">
