index.org
*** TODO Subplots
If there's a main plot that explores the themes and "answers" the question posed (e.g. "how will society progress in a technological post-apocalyptic world", "what will our relationship to technology be and will it be good or bad"), there are subplots that are tangents to the main plot. These can be explored by quests or interactions.

They can influence the main plot but not too much -- if it's a particular /section/ of the actual main plot, it belongs in the main plot progression.

*** TODO Other Characters
Who are the other characters and what role do they play?

*** TODO Places
What locations are there in the world? Not all necessarily exist as in-game locations, they can be alluded to in plot.

*** TODO Relationships
**** of Places to Places
**** of Characters to Characters

* Realization of Narrative
This section describes how the narrative elements are realized using gameplay and style.
Think of there being an actual "Machimania" universe - what parts of the Machimania universe exists in-game instead of in-universe? For example, the Machimania planet has a *lot* of places, but we can only choose to realize or represent certain locations.

*** TODO Plot Progression
*** TODO Locations
*** TODO Map Design
*** TODO Gameplay
**** TODO Modularity
*** TODO Art and Music

* Gameplay
** TODO Features
*** TODO Gameplay loops
**** TODO Broader loop
Menu -> game instance -> location -> battle -> location -> battle ...
**** TODO Battle loop
player X turn -> select actions -> execute actions -> player X+1 turn -> ... -> win/lose condition
*** TODO User interface and controls
*** TODO Global systems

Refers to the persistent, over-arching mechanics of the game.

They give a sense of continuity or progression (i.e. stats or bestiary or personal wiki increasing over time) (quests), help with information overload (bestiary, stats, wiki, quests), add some beyond battle strategizing (time, stats in battle, stats affecting movement in map, stats affecting dialogue trees) and interacts with narrative (quests determining where to go, wiki)...

**** TODO Player-centric
***** TODO Quests
***** TODO Player Stats
***** TODO Bestiary
***** TODO Personal Wiki
***** TODO Inventory
**** TODO World State / Map
***** TODO Time

*** TODO In-map interactions

Refers to the mechanics present when you interact with things or NPCs in the map.


**** TODO NPC interactions
***** Dialogue trees
***** Dialogue display
**** TODO Terrain
**** TODO Obstacles
**** TODO Interactables
**** TODO Scenery
*** TODO Battle system
**** TODO Turn economy
**** TODO Terrain
**** TODO Team composition
**** TODO Entities
**** TODO Actions in a turn
**** TODO Win/lose condition
** TODO Strategy and Progression
By strategy I mean the high level techniques or rules-of-thumb or trade-offs that allows the player to play more efficiently in response to certain enemies or maps. If choices in gameplay or dialogue affect the narrative, it also may involve strategizing about narrative choices.

* Current work
What's been planned and implemented and where is it?
** TODO Prototype
** TODO Notes
