index.html
<li><a id="org8b26f2d"></a>Intro<br /></li>
<li><a id="org9acfb37"></a>Rising action<br /></li>
<li><a id="orgef011e5"></a>Climax<br /></li>
<li><a id="orgbd1a77c"></a>Falling action<br /></li>
<li><a id="org84a042a"></a>Ending(s)<br /></li>
</ol>
</div>
<div id="outline-container-org737760f" class="outline-4">
<h4 id="org737760f"><span class="section-number-4">2.1.7.</span> <span class="todo TODO">TODO</span> Subplots</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
If there&rsquo;s a main plot that explores the themes and &ldquo;answers&rdquo; the question posed (e.g. &ldquo;how will society progress in a technological post-apocalyptic world&rdquo;, &ldquo;what will our relationship to technology be and will it be good or bad&rdquo;), there are subplots that are tangents to the main plot. These can be explored by quests or interactions.
</p>

<p>
They can influence the main plot but not too much &#x2013; if it&rsquo;s a particular <i>section</i> of the actual main plot, it belongs in the main plot progression.
</p>
</div>
</div>
<div id="outline-container-org3fab615" class="outline-4">
<h4 id="org3fab615"><span class="section-number-4">2.1.8.</span> <span class="todo TODO">TODO</span> Other Characters</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
Who are the other characters and what role do they play?
</p>
</div>
</div>
<div id="outline-container-org6177be2" class="outline-4">
<h4 id="org6177be2"><span class="section-number-4">2.1.9.</span> <span class="todo TODO">TODO</span> Places</h4>
<div class="outline-text-4" id="text-2-1-9">
<p>
What locations are there in the world? Not all necessarily exist as in-game locations, they can be alluded to in plot.
</p>
</div>
</div>
<div id="outline-container-orge1a3733" class="outline-4">
<h4 id="orge1a3733"><span class="section-number-4">2.1.10.</span> <span class="todo TODO">TODO</span> Relationships</h4>
<div class="outline-text-4" id="text-2-1-10">
</div>
<ol class="org-ol">
<li><a id="orgf53b391"></a>of Places to Places<br /></li>
<li><a id="orga974dbb"></a>of Characters to Characters<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5ba1fb8" class="outline-2">
<h2 id="org5ba1fb8"><span class="section-number-2">3.</span> Realization of Narrative</h2>
<div class="outline-text-2" id="text-3">
<p>
This section describes how the narrative elements are realized using gameplay and style.
Think of there being an actual &ldquo;Machimania&rdquo; universe - what parts of the Machimania universe exists in-game instead of in-universe? For example, the Machimania planet has a <b>lot</b> of places, but we can only choose to realize or represent certain locations.
</p>
</div>
<div id="outline-container-orga0a74db" class="outline-4">
<h4 id="orga0a74db"><span class="section-number-4">3.0.1.</span> <span class="todo TODO">TODO</span> Plot Progression</h4>
</div>
<div id="outline-container-org4502809" class="outline-4">
<h4 id="org4502809"><span class="section-number-4">3.0.2.</span> <span class="todo TODO">TODO</span> Locations</h4>
</div>
<div id="outline-container-orga2d81e1" class="outline-4">
<h4 id="orga2d81e1"><span class="section-number-4">3.0.3.</span> <span class="todo TODO">TODO</span> Map Design</h4>
</div>
<div id="outline-container-orgd1f85c6" class="outline-4">
<h4 id="orgd1f85c6"><span class="section-number-4">3.0.4.</span> <span class="todo TODO">TODO</span> Gameplay</h4>
<div class="outline-text-4" id="text-3-0-4">
</div>
<ol class="org-ol">
<li><a id="org9e3f057"></a><span class="todo TODO">TODO</span> Modularity<br /></li>
</ol>
</div>
<div id="outline-container-org9493706" class="outline-4">
<h4 id="org9493706"><span class="section-number-4">3.0.5.</span> <span class="todo TODO">TODO</span> Art and Music</h4>
</div>
</div>
<div id="outline-container-org665d7a7" class="outline-2">
<h2 id="org665d7a7"><span class="section-number-2">4.</span> Gameplay</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga573106" class="outline-3">
<h3 id="orga573106"><span class="section-number-3">4.1.</span> <span class="todo TODO">TODO</span> Features</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org0366640" class="outline-4">
<h4 id="org0366640"><span class="section-number-4">4.1.1.</span> <span class="todo TODO">TODO</span> Gameplay loops</h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
<ol class="org-ol">
<li><a id="org43f6cfc"></a><span class="todo TODO">TODO</span> Broader loop<br />
<div class="outline-text-5" id="text-4-1-1-1">
<p>
Menu -&gt; game instance -&gt; location -&gt; battle -&gt; location -&gt; battle &#x2026;
</p>
</div>
</li>
<li><a id="orgef16ddd"></a><span class="todo TODO">TODO</span> Battle loop<br />
<div class="outline-text-5" id="text-4-1-1-2">
<p>
player X turn -&gt; select actions -&gt; execute actions -&gt; player X+1 turn -&gt; &#x2026; -&gt; win/lose condition
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd7c9946" class="outline-4">
<h4 id="orgd7c9946"><span class="section-number-4">4.1.2.</span> <span class="todo TODO">TODO</span> User interface and controls</h4>
</div>
<div id="outline-container-org8bbc30b" class="outline-4">
<h4 id="org8bbc30b"><span class="section-number-4">4.1.3.</span> <span class="todo TODO">TODO</span> Global systems</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Refers to the persistent, over-arching mechanics of the game.
</p>

<p>
They give a sense of continuity or progression (i.e. stats or bestiary or personal wiki increasing over time) (quests), help with information overload (bestiary, stats, wiki, quests), add some beyond battle strategizing (time, stats in battle, stats affecting movement in map, stats affecting dialogue trees) and interacts with narrative (quests determining where to go, wiki)&#x2026;
</p>
</div>
<ol class="org-ol">
<li><a id="org211fd26"></a><span class="todo TODO">TODO</span> Player-centric<br />
<ul class="org-ul">
<li><a id="orgca2019a"></a><span class="todo TODO">TODO</span> Quests<br /></li>
<li><a id="org273810e"></a><span class="todo TODO">TODO</span> Player Stats<br /></li>
<li><a id="orga91ec23"></a><span class="todo TODO">TODO</span> Bestiary<br /></li>
<li><a id="org2f4a6e2"></a><span class="todo TODO">TODO</span> Personal Wiki<br /></li>
<li><a id="org058ec78"></a><span class="todo TODO">TODO</span> Inventory<br /></li>
</ul>
</li>
<li><a id="org2bc4a83"></a><span class="todo TODO">TODO</span> World State / Map<br />
<ul class="org-ul">
<li><a id="orgfd21bfb"></a><span class="todo TODO">TODO</span> Time<br /></li>
</ul>
</li>
</ol>
</div>
<div id="outline-container-orgd9505d8" class="outline-4">
<h4 id="orgd9505d8"><span class="section-number-4">4.1.4.</span> <span class="todo TODO">TODO</span> In-map interactions</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Refers to the mechanics present when you interact with things or NPCs in the map.
</p>
</div>
<ol class="org-ol">
<li><a id="org7894f85"></a><span class="todo TODO">TODO</span> NPC interactions<br />
<ul class="org-ul">
<li><a id="org7ec9037"></a>Dialogue trees<br /></li>
<li><a id="orgccd5834"></a>Dialogue display<br /></li>
</ul>
</li>
<li><a id="orgc2a2963"></a><span class="todo TODO">TODO</span> Terrain<br /></li>
<li><a id="org7613ab6"></a><span class="todo TODO">TODO</span> Obstacles<br /></li>
<li><a id="org0a4c649"></a><span class="todo TODO">TODO</span> Interactables<br /></li>
<li><a id="org917ead2"></a><span class="todo TODO">TODO</span> Scenery<br /></li>
</ol>
</div>
<div id="outline-container-org07eeda6" class="outline-4">
<h4 id="org07eeda6"><span class="section-number-4">4.1.5.</span> <span class="todo TODO">TODO</span> Battle system</h4>
<div class="outline-text-4" id="text-4-1-5">
</div>
<ol class="org-ol">
<li><a id="org567f247"></a><span class="todo TODO">TODO</span> Turn economy<br /></li>
<li><a id="orga1e42e9"></a><span class="todo TODO">TODO</span> Terrain<br /></li>
<li><a id="orgee54c45"></a><span class="todo TODO">TODO</span> Team composition<br /></li>
<li><a id="org5543aa7"></a><span class="todo TODO">TODO</span> Entities<br /></li>
<li><a id="org24a0741"></a><span class="todo TODO">TODO</span> Actions in a turn<br /></li>
<li><a id="orgfee23f9"></a><span class="todo TODO">TODO</span> Win/lose condition<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org70899bf" class="outline-3">
<h3 id="org70899bf"><span class="section-number-3">4.2.</span> <span class="todo TODO">TODO</span> Strategy and Progression</h3>
<div class="outline-text-3" id="text-4-2">
<p>
By strategy I mean the high level techniques or rules-of-thumb or trade-offs that allows the player to play more efficiently in response to certain enemies or maps. If choices in gameplay or dialogue affect the narrative, it also may involve strategizing about narrative choices.
</p>
</div>
</div>
</div>
<div id="outline-container-org5a60261" class="outline-2">
<h2 id="org5a60261"><span class="section-number-2">5.</span> Current work</h2>
<div class="outline-text-2" id="text-5">
<p>
What&rsquo;s been planned and implemented and where is it?
</p>
</div>
<div id="outline-container-orgecb836e" class="outline-3">
<h3 id="orgecb836e"><span class="section-number-3">5.1.</span> <span class="todo TODO">TODO</span> Prototype</h3>
</div>
<div id="outline-container-org1a76ce7" class="outline-3">
<h3 id="org1a76ce7"><span class="section-number-3">5.2.</span> <span class="todo TODO">TODO</span> Notes</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-01-26 Sun 14:37</p>
</div>
</body>
</html>
